[
    {
        "id": 1,
        "image": "meettheteam.png",
        "title": "What is Tandem?",
        "excerpt": "Who are we, and why it matters.",
        "content": " Did you know 63% of tradeswomen are parents—and all of them struggle with childcare? \n\n Childcare in BC is already tough. Add the unpredictable schedules of tradeswork, and it becomes nearly impossible to manage. For many, this isn’t a hypothetical—it’s their daily reality. That’s why Tandem is here: to bridge the gap between work and care. \n\n  Tandem is an app for parents in trades to help balance work with childcare. It utilizes AI to help busy parents balance the responsibilities of work and childcare, providing trustworthy recommendations and supportive childcare. It allows parents in the trades to find childcare easily, reducing stress and improving work-life balance. \n\n  Instead of a world where childcare feels overwhelming and inconsistent, Tandem offers one that’s supportive, flexible, and reliable. \n\n Trustworthy. Balance. Support. These are the words we strive to bring to everyone's lives.",
        "author": "Thea Calaquian",
        "date": "October 13, 2025",
        "category": ["Meet Tandem!", "Introduction"]
    },
    {
        "id": 6,
        "image": "week 6.png",
        "title": "Week 6: Full Steam Ahead!",
        "excerpt": "This week we finalized our research and are moving onward!",
        "content": "## Introduction\n\nThis week felt really chaotic! It was a mix of trying to figure out research, our main feature, and our workflow! From going out and talking to real parents in trades to holding team meetings to refine our work, this week was filled with a lot of progress, creativity and team work. Week 6 was all about refining our idea and going out and connecting with real people who face the issue we're tackling. Here's what we've been up to!\n\n## Design team\n\nWe were fully hands on with our research and design\n\n- Research: We started our week by handing out our survey and collecting results\n- Workflow: We met up and refined our workflow after our research results to fit the needs of our users completely!\n- Logo: We started to finalize our logo design! Special thanks to our lovely teammates Bonnie and Sandy for all their hard work!\n\n## Dev team\n\nOur dev team was hard at work with us!\n\n- Research: A lot of research. They researched all about every single function or thing we could implement into our app\n- Code testing: Alongside this research, they've been testing it out every step of the way!\n\n## Team moment: A struggle for results\n[IMAGE: BlogPost/Week6.JPG|Week 6 team moment]\n[IMAGE: BlogPost/Dog.PNG|Week 6 team moment]\nLet me tell you, this week was one of highs and lows, in which we came out victorious. We barely knew any parents in trades, so we had to find ways to get people to take our survey. Thus, two of our teammates were sent out. Angie and Thea (yup, that's me!) went out to a pizza lunch at the ConnectHer Hub at BCIT! We got to hear from so many people, and got to really learn about the people our app is for! At the end, after two grueling hours of making sure we asked everyone who walked in if they knew anyone or were a parent in trades, we managed to pull through and get all the survey results we needed!\n\n## Looking ahead: week 7\n\nAs we head into week 7, it's full steam ahead! We're working on our app even more, finalizing where we're heading and bringing it to life!",
        "author": "Thea Calaquian",
        "date": "October 13, 2025",
        "category": ["Week 6", "Blog Post"]
    },
    {
        "id": 7,
        "image": "week7.png",
        "title": "Week 7: Locked In",
        "excerpt": "The team fully locked in, and huge steps were made!",
        "content": "Introduction \n\nThis week was hectic! The team really pushed to get work done, and we finished making our first hifi version of our app using the information we gathered from week 6. Week 7 was all about implementing what we learned to make our app perfect for our users. Here’s what we’ve been up to!\n\nDesign team \n\nWe were fully hands on with our hifi\n- Research: We started our week by using the research we got last week and implementing it into our work \n- Design: We finished our first polished version of our app to get ready to be reviewed!\n- Logo: We decided on a logo! With this, we now have a consistent theme that our app revolves around.\n\nDev team\n\n Our dev team was working hard as well!\n- Research: The dev team was also able to implement the research they did for our AI upload and scheduling to their own code! With our hifi existing, they were also able to now work on the frontend as well. \n- Code testing: Alongside this research, they’ve been testing it out every step of the way!\n\nTeam moment: A joint group effort \n\nThis was a week where everyone was going full steam ahead. Many of us had late night calls, working to perfect our app. It was a week of team bonding (and suffering admittedly). Many cups of coffee were inhaled during this week. We were really glad for all the research we got from everyone, as it really helped us understand what to do going ahead. At the end, we managed to make it through our work filled week with a product we could be proud of!\n\nLooking ahead: week 8\n\nWe’re editing and implementing even more to our app to best fit our users, and making something that truly aligns with our goal, to support tradesparents!",
        "author": "Thea Calaquian",
        "date": "October 20th, 2025",
        "category": ["Week 7", "Blog Post"]
    },
    {
        "id": 8,
        "image": "week 8.png",
        "title": "Week 8: Adventure Week! (And Midterm week)",
        "excerpt": "A week of adventure and collaboration!",
        "content": "Introduction\n\nThis was an interesting week for both teams! The D3 team adventured down to the BCIT campus to work with our Dev team to prepare for our midterm presentation! This week was full of energy and nerves for both our teams as we prepped ourselves to present Tandem. Here’s what we’ve been up to!\n\nDesign team\n\nWe were all about editing and creation!\n- Midterm: We finalized our script and finished creating our presentation slides!\n- Design: We continued to implement feedback into the design of our app, editing and deciding for a full rework of colours to make our app seem more lively.\n\nDev team\n\nOur dev team finished their amazing coded out first version of our app!\n- Coding: The dev team finished making the first fully coded version of our app with fully working features!\n- Frontend work: The team continued to update the frontend work they did to match the D3’s teams ever evolving progress.\n\nTeam moment: Downtown meetup!\n\nThis was a very adventurous week for us D3 students, and a very funny week for the Dev team. We decided to meet up with the Dev team at the downtown campus to practice and go over everything for our midterm. For many of us it was an enjoyable time, also allowing us to explore and look around the downtown area, which we normally don’t get to do! The Dev team found it funny to see us bumble around, unused to the surroundings. Through the struggles of the Dev team trying to find a study room and a very common theme of D3 students purchasing matcha, we finally managed to settle down and refine our midterm presentation! We felt fully prepared and ready to tackle the challenge ahead, and were excited to see where this would lead!\n\nLooking ahead: week 9\n\nAfter our midterm, we plan to rework our current design to better fit our audience, and to start user testing on our hifi to make sure that we always have tradesparents at the forefront of all our decision making. ",
        "author": "Thea Calaquian",
        "date": "October 27th, 2025",
        "category": ["Week 8", "Blog Post"]
    },
    {
        "id": 9,
        "image": "week9.png",
        "title": "Week 9: Chaos and Creation",
        "excerpt": "Lots of work done, lots of caffeine consumed.",
        "content": "Introduction\n\nThis was a week of both creation and the chaos that followed. Adjusting all our design was a difficult task to the D3, and late nights were spent trying to make everything cohesive, and making sure we didn’t break anything in our prototyping. All the while, the Dev team could only watch and wait for us to finish. This week was filled with team chaos which led to team bonding, and was a true test of how cohesive of a team we were! Here’s what we’ve been up to!\n\nDesign team\n\nWe fully focused ourselves on redoing design and fixing prototyping!\n- Design: We decided as a team on what needed to be reworked in terms of design, and changed our colour palette to have a brighter, more welcoming feel!\n- Print: We started discussing our printed material for the showcase! We discussed brochures, keychains, business cards, cookies, and so much more! We have big plans in store.\n- Prototyping: While some of us implemented our new design, the others reduced the work needed and fixed any broken prototyping found.\n\nDev team\n\nOur dev team was constantly reiterating and also creating our nanny share function!\n- New feature: The dev team was hard at work creating our newest feature, nanny sharing! It was a big task, but they managed to divide and conquer.\n- Components: They also focused on updating components to match our new design\n\nTeam moment: Clarification time!\n\nTired and weary from the past few weeks of constant work, many of us needed some time to reconvene and make sure we were all on the same page. As we made our way down to a creative room at the BCIT Burnaby campus, we all managed to clarify and ask our questions. We found ourselves amused also, as there were many…many fidget toys. Many slinkies and pop sockets were used, and it was definitely a strange morale boost for all of us. \n\nLooking ahead: week 10\n\nAs we head into week 10, we want to focus on testing both the D3 and Dev side of our work! Again, we want to make sure we’re fully centered and committed to who we’re making this app for.",
        "author": "Thea Calaquian",
        "date": "November 3rd, 2025",
        "category": ["Week 9", "Blog Post"]
    },
    {
        "id": 10,
        "image": "week10.png",
        "title": "Week 10: Slowly Closing In",
        "excerpt": "Getting closer to the finish line!",
        "content": "Introduction\n\nThis was a very interesting week. The D3 team headed down to Langley to film, all while the Dev team overlooked all the D3 work, and also helped assign code work to the D3 team. The teams also decided to celebrate our midterm work (finally) and went out to hang out! It was a week filled with outings and team collaboration. Here’s what we’ve been up to!\n\nDesign team\n\nWe were dedicated to film for our advertisement! \n- Filming: We headed down to Langley for our actors, and got all the shots we needed. It was a lot of experimentation and learning along the way, but it was a fun experience. (Plus, the team got to eat at Bigway together, which was a blast of course.)\n- Print: The team divided the work and has gone on to working on making our ideas a reality. We’re excited to finally see our creations made in person!\n\nDev team\n\nOur dev team is constantly working hard and implementing every new detail!\n- Revision: The team is constantly checking our work to make sure their code aligns with our design, and they’re very attentive to every little detail!\n- Meetings: The Dev team has been frequently meeting to help and uplift each other through any difficulties\n- Roadmap: Alongside every time, the Dev team now has a clear roadmap to follow!\n\nTeam moment: A fun time out!\n\nI know you’re used to me, Thea, writing these parts, but I’ll pass it onto Sandy, as I was actually unable to attend unfortunately. \n\nThe team hosted a meet-up on Wednesday where we enjoyed pho together and played a board game. It was really nice to sit down, relax, and share our thoughts outside of project work. Moments like these help us understand each other better and strengthen our team connection. We’re a group coming from different parts of the world, each bringing unique values and perspectives to the project, and spending time together like this feels genuinely warm and meaningful.\n\nLooking ahead: week 11\n\nAs we head into week 10, we want to focus on testing both the D3 and Dev side of our work! Again, we want to make sure we’re fully centered and committed to who we’re making this app for.",
        "author": "Thea Calaquian",
        "date": "November 10th, 2025",
        "category": ["Week 10", "Blog Post"]
    },
    {
        "id": 11,
        "image": "week11.png",
        "title": "Week 11: Work, Work, Work!",
        "excerpt": "Where hard work and dedication shines.",
        "content": " Introduction\n\n This week was spent indoors for D3, which meant the teams didn’t get to see each other. We didn’t let that hinder us though, as we all hunkered down and kept working away. The dev team spent their time focused on the schedule part of the app, since it’s a core part of it. The D3 team spent their time working on the print materials while starting the user testing process. Design Team\n- Editing + Revisions\n- Video: The D3 team has compiled the clips recorder last week and organized them, having them ready to edit.\n- Print materials: The team has continued to work on the materials, sharing design progress and gathering feedback as they go.\n- User testing: The team conducted their user testing this week, gathering feedback to better align the app with their audience.\n\nDev Team:\n- Reviews and schedule deep dive\n- Schedule feature: The dev team gave the schedule feature their full attention, making sure no stone was left unturned when fleshing it out.\n- Review: They continue to review each other's code and test the app’s functionality to make sure everything’s in working order.\n\nTeam moment: Emoji Madness\nExhausted from yet another week of work, the team needed a slight pick me up, a morale boost. We realized how many odd and off putting photos we had of each other, and soon enough our Discord server was filled with custom made emojis of each team member. They’re now a staple in every message sent, and they’re quite the pick me up. Even through the most complex of tasks, everyone can take a moment and laugh at the silly emojis we’ve made. \n\nLooking Ahead: Week 12As we continue to work on stuff, for week 12 we plan to finish our print materials and start editing our clips for the video, also finding audio to use. We also plan to help guide each other as the D3 start their frontend coding.",
        "author": "Thea Calaquian",
        "date": "November 17th, 2025",
        "category": ["Week 11", "Blog Post"]
    },
    {
        "id": 12,
        "image": "week12.png",
        "title": "Week 12: Marketing? Design? Coding? Oh my!",
        "excerpt": "Where hard work, design, and coding come together.",
        "content": "Introduction\n\n It’s been a busy week back on campus, with the pressure building as we near the end. The D3 team continued on with the print materials and video editing, while also starting their part of the code. The dev team has continued to work on the backend, ironing out any issues that arise while guiding D3 when questions come up.\n\nDesign Team\nExtra materials + Code\nPrint materials: The team completed the business cards, stickers, and brochure in time to be printed! We also made plans for extra materials to use on the big day.\nCoding: The team has gone head-first into coding this week. With the frontend parts assigned, everyone has set up their branch to get to work.\nVideo editing: With the clips recorded from last week, the promotional video is now in the works of being edited!\n\nDev Team:\nMore team reviews + meetings\nMeetings: The devs spent hours in meetings (one even being 6-7hours long ☠️) fleshing out the logic behind all our functions, guaranteeing things would run smoothly.\nGuidance: The dev team has helped the D3 side in setting up their coding work, answering any questions we may have as we learn a new build.\nBug fixing: They went through the current app flows and fixed any issues that popped up, while also continuing work on the core functionality. \n\nTeam moment: Impromptu outing!\nAs we prepared for our presentations coming up, we agreed on our uniforms so we’d all match. We decided last minute to make it into a mini group outing to all buy the matching shirts we wanted. While no one could stay for long after, it was still nice to be able to do something spontaneous together, even if still for the project.😅 Looking Ahead: Week 13\n As we head into week 13, we are preparing our presentation materials for our mock on Wednesday, while also continuing to code and create our extra promotional materials in time for the real deal 2 weeks away. We are also preparing the video in hopes it will be done within this next week!",

        "author": "Thea Calaquian",
        "date": "November 24th, 2025",
        "category": ["Week 12", "Blog Post"]
    }
]
